In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

username = "root"
password = "ManonFire12!" # (or whatever password you chose during mysql installation)
connection = f"mysql+pymysql://{username}:{password}@localhost/movies"
    
engine = create_engine(connection)

In [2]:
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [24]:
basics = pd.read_csv('Data/final_basics.csv.gz',low_memory = False)
ratings = pd.read_csv('Data/final_ratings.csv.gz', low_memory = False)

In [26]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 492984 entries, 0 to 492983
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       492984 non-null  int64
dtypes: int64(1)
memory usage: 3.8 MB

# Genre's Table

## Getting List of Unique Genres

In [5]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance","[Musical, Romance]"
2,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama","[Action, Adventure, Drama]"
3,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action,[Action]
4,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
2989,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller","[Horror, Thriller]"
2990,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action,[Action]
2991,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action,[Action]
2992,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror,[Horror]
2993,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama,[Drama]

In [6]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Musical
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Romance
...,...,...,...,...,...,...,...,...,...,...
2989,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller",Thriller
2990,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action,Action
2991,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action,Action
2992,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror,Horror
2993,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama,Drama

In [7]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [8]:
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Thriller',
 'War',
 'Western']

## Create a new `title_genres` table

In [9]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0113026      Musical
1  tt0113026      Romance

## Create a Genre Mapper Dictionary

In [10]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'History': 10,
 'Horror': 11,
 'Music': 12,
 'Musical': 13,
 'Mystery': 14,
 'Reality-TV': 15,
 'Romance': 16,
 'Sci-Fi': 17,
 'Short': 18,
 'Sport': 19,
 'Thriller': 20,
 'War': 21,
 'Western': 22}

## Replace the String Genres in `title_genres` with the New Integer Ids

In [11]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

## Convert the Genre Map Dictionary into a Dataframe

In [12]:
genre_lookup = pd.DataFrame({ 'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [13]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  23 non-null     object
 1   Genre_ID    23 non-null     int64
dtypes: int64(1), object(1)
memory usage: 496.0+ bytes

# MySQL

## Basics Table

In [14]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2994 entries, 0 to 2993
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          2994 non-null   object
 1   titleType       2994 non-null   object
 2   primaryTitle    2994 non-null   object
 3   originalTitle   2994 non-null   object
 4   isAdult         2994 non-null   int64
 5   startYear       2994 non-null   float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  2994 non-null   int64
 8   genres          2994 non-null   object
 9   genres_split    2994 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 234.0+ KB

In [15]:
basics = basics.drop(columns=['originalTitle', 'genres', 'genres_split'])

In [16]:
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    "isAdult":Integer(),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [17]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

2994

In [18]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Genre Table

In [19]:
genre_title = genre_lookup['Genre_Name'].fillna('').map(len).max()

genre_schema = {
    "Genre_Name": String(genre_title+1),
    "Genre_ID": Integer()
}

In [20]:
genre_lookup.to_sql('genres', engine, dtype=genre_schema, if_exists='replace', index=False)

23

## Ratings Table

In [23]:
ratings.head()

   0
0  1
1  1
2  1
3  1
4  1